___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 10</p><h1>

<h1><p style="text-align: center;">Working with Text and Time Data</p><h1>

# Working with Text Data

## String Methods
https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html

https://www.w3schools.com/python/python_ref_string.asp

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df = pd.read_excel("../data&resources/text_exercise.xlsx")
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

___

- **lower()		  =>** Converts a string into lower case
- **upper()		  =>** Converts a string into upper case
- **capitalize()  =>** Converts the first character to upper case
- **title()		  =>** Converts the first character of each word to upper case
- **swapcase()    =>** Swaps the case lower/upper

___

In [4]:
df.staff.str.lower()

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smi̇th
6      adrian star
7     albert simon
Name: staff, dtype: object

In [5]:
df.staff.str.upper()

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMİTH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object

In [6]:
df.staff.str.title()

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar Smi̇th
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

In [7]:
df.staff.str.capitalize()

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smi̇th
6      Adrian star
7     Albert simon
Name: staff, dtype: object

In [8]:
df.staff.str.swapcase()

0         tOM blue
1       john black
2    mICHEAL bROWN
3     JASON WALKER
4       aLEX gREEN
5     oscar smi̇th
6      aDRIAN star
7     aLBERT SIMON
Name: staff, dtype: object

___

- **isalpha()     =>** Returns True if all characters in the string are in the alphabet
- **isnumeric()   =>** Returns True if all characters in the string are numeric
- **isalnum()     =>** Returns True if all characters in the string are alphanumeric
- **endswith()	=>** Returns true if the string ends with the specified value
- **startswith()	=>** Returns true if the string starts with the specified value
- **contains()	=>** Returns a Boolean value True for each element if the substring contains in the element, else False.

___

In [9]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [10]:
df.job.str.isalpha()

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

In [11]:
df.age.str.isnumeric()

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [12]:
df.age.astype("string").str.isnumeric()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: age, dtype: boolean

In [13]:
df.salary.str.isalnum()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

In [14]:
df.job.str.startswith("d")

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [15]:
df.job.str.endswith("per")

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

In [16]:
df.job.str.contains("data")

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [17]:
df.salary.str.contains(r"[a-z]", regex = True)

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

we can use these string methods which returning boolean expression for creating condition and so selecting relative rows

In [18]:
df[df.job.str.contains("data")]

      id          staff department             job       salary age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35
6  E0005    Adrian STAR         IT  data scientist   "$135,000"  40
7  E0006   Albert simon         IT  data scientist  125000dolar  35

In [19]:
df.loc[df.job.str.contains("data"), "department"]

2    IT
6    IT
7    IT
Name: department, dtype: object

In [20]:
df.loc[df.job.str.contains("data"), "department"] = "DS"
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         DS      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         DS      data scientist   "$135,000"  40
7  E0006   Albert simon         DS      data scientist  125000dolar  35

In [21]:
df.loc[df.job.str.contains("data"), "department"] = "IT"
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

___

- **replace() =>** Returns a string where a specified value is replaced with a specified value

- **split()	=>** Splits the string at the specified separator, and returns a list

- **strip()	=>** Returns a trimmed version of the string

- **find()	=>** Searches the string for a specified value and returns the position of where it was found

- **findall()	=>** Returns a list of all occurrence of the pattern.

- **join()	=>** Converts the elements of an iterable into a string

___

In [22]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [23]:
df.salary.str.strip("\"")

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [24]:
df.salary.str.strip("\"").str.rstrip("dolar")

0    $150,000
1    $180,000
2    $150,000
3      130000
4    $110,000
5    $120,000
6    $135,000
7      125000
Name: salary, dtype: object

In [25]:
df.salary.str.strip("\"").str.rstrip("dolar").str.lstrip("$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [26]:
df.salary.str.strip("\"dolar$")

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [27]:
df.salary.str.strip("\"dolar$").str.replace(",", "")
#df.salary.str.strip("\"dolar$").replace(",", "") # gives an error

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

In [28]:
df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [29]:
df["salary"] = df.salary.str.strip("\"dolar$").str.replace(",", "").astype(float)
df.salary

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [30]:
df.age

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

In [31]:
df.age.replace("-", np.nan)
#df.age.str.replace("-", np.nan) # gives an error

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

In [32]:
df["age"] = df.age.replace("-", np.nan)
df.age

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

**str.replace() vs .replace()**

- **Purpose:** Use **str.replace** for substring replacements on a single string column, and **replace** for any general replacement on one or more columns.

- **Usage:** **str.replace** can replace one thing at a time. **replace** lets you perform multiple independent replacements, i.e., replace many things at once.

- **Default behavior:** **str.replace** enables regex replacement by default. **replace** only performs a full match unless the regex=True switch is used.

In [33]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMİTH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [34]:
df.staff.str.title().str.split().str[0]

0        Tom
1       John
2    Micheal
3      Jason
4       Alex
5      Oscar
6     Adrian
7     Albert
Name: staff, dtype: object

In [35]:
df["name"] = df.staff.str.title().str.split().str[0]
df["sir_name"] = df.staff.str.title().str.split().str[1]
df.drop("staff", axis=1, inplace=True)

In [36]:
df

      id department                 job    salary   age     name sir_name
0  M0001         HR             manager  150000.0  52.0      Tom     Blue
1  M0002         IT             manager  180000.0  48.0     John    Black
2  E0001         IT      data scientist  150000.0  35.0  Micheal    Brown
3  E0002         HR           recruiter  130000.0  38.0    Jason   Walker
4  E0003         IT   backend developer  110000.0   NaN     Alex    Green
5  E0004         IT  frontend developer  120000.0  32.0    Oscar   Smi̇th
6  E0005         IT      data scientist  135000.0  40.0   Adrian     Star
7  E0006         IT      data scientist  125000.0  35.0   Albert    Simon

In [37]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [38]:
df.job.str.find("s")

0   -1
1   -1
2    5
3   -1
4   -1
5   -1
6    5
7    5
Name: job, dtype: int64

In [39]:
df.job.str.findall("s")

0        []
1        []
2    [s, s]
3        []
4        []
5        []
6    [s, s]
7    [s, s]
Name: job, dtype: object

In [40]:
df["skills"] = [[],["Java","C++"],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df["Skills"] = [[],[],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df.loc[1, "Skills"] = "Java,C++"
df

,id,department,job,salary,age,name,sir_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],[]
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java,C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],[]
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","[React, Django]"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,Smi̇th,"[JavaScript, Python]","[JavaScript, Python]"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","[R, SQL]"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","[SQL, Python]"

In [41]:
df.skills.str.join(",")

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: skills, dtype: object

In [42]:
df.Skills.str.join(",")

0
1       J,a,v,a,,,C,+,+
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [43]:
df.Skills.apply(lambda item: ",".join(item) if type(item) == list else item)

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [44]:
[",".join(item) if type(item) == list else item for item in df.Skills]

['',
 'Java,C++',
 'Python,Tableau,SQL',
 '',
 'React,Django',
 'JavaScript,Python',
 'R,SQL',
 'SQL,Python']

In [45]:
df["Skills"]=[",".join(item) if type(item) == list else item for item in df.Skills]
df.Skills

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [46]:
df

,id,department,job,salary,age,name,sir_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java,C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","Python,Tableau,SQL"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","React,Django"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,Smi̇th,"[JavaScript, Python]","JavaScript,Python"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","R,SQL"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","SQL,Python"

## Dummy Operation

### get_dummies()


1. pd.get_dummies(df/df["col_name"])


2. df["col_name"].get_dummies(sep = ",")

In [47]:
pd.get_dummies(df.department)

   HR  IT
0   1   0
1   0   1
2   0   1
3   1   0
4   0   1
5   0   1
6   0   1
7   0   1

In [48]:
pd.get_dummies(df.department, drop_first=True)

   IT
0   0
1   1
2   1
3   0
4   1
5   1
6   1
7   1

In [49]:
df.Skills

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [50]:
df.Skills.str.get_dummies(sep=",")

   C++  Django  Java  JavaScript  Python  R  React  SQL  Tableau
0    0       0     0           0       0  0      0    0        0
1    1       0     1           0       0  0      0    0        0
2    0       0     0           0       1  0      0    1        1
3    0       0     0           0       0  0      0    0        0
4    0       1     0           0       0  0      1    0        0
5    0       0     0           1       1  0      0    0        0
6    0       0     0           0       0  1      0    1        0
7    0       0     0           0       1  0      0    1        0

In [51]:
df.Skills.str.get_dummies(sep=",").add_prefix("skills_")

,skills_C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,0,0,0,0,0,0,0,0,0
1,1,0,1,0,0,0,0,0,0
2,0,0,0,0,1,0,0,1,1
3,0,0,0,0,0,0,0,0,0
4,0,1,0,0,0,0,1,0,0
5,0,0,0,1,1,0,0,0,0
6,0,0,0,0,0,1,0,1,0
7,0,0,0,0,1,0,0,1,0

In [52]:
skills_dummy = df.Skills.str.get_dummies(sep=",").add_prefix("skills_")

In [53]:
df_final = df[["department", "job", "salary", "Skills"]]
df_final

  department                 job    salary              Skills
0         HR             manager  150000.0
1         IT             manager  180000.0            Java,C++
2         IT      data scientist  150000.0  Python,Tableau,SQL
3         HR           recruiter  130000.0
4         IT   backend developer  110000.0        React,Django
5         IT  frontend developer  120000.0   JavaScript,Python
6         IT      data scientist  135000.0               R,SQL
7         IT      data scientist  125000.0          SQL,Python

In [54]:
df_final.join(skills_dummy)

,department,job,salary,Skills,skills_C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,HR,manager,150000.0,,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,"Java,C++",1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,"Python,Tableau,SQL",0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,"React,Django",0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,"JavaScript,Python",0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,"R,SQL",0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,"SQL,Python",0,0,0,0,1,0,0,1,0

In [55]:
df_final = df_final.join(skills_dummy)
df_final.drop("Skills", axis=1, inplace=True)

In [56]:
df_final

,department,job,salary,skills_C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,HR,manager,150000.0,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,0,0,0,0,1,0,0,1,0

In [57]:
pd.get_dummies(df_final,drop_first = True)

,salary,skills_C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau,department_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,150000.0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,180000.0,1,0,1,0,0,0,0,0,0,1,0,0,1,0
2,150000.0,0,0,0,0,1,0,0,1,1,1,1,0,0,0
3,130000.0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
4,110000.0,0,1,0,0,0,0,1,0,0,1,0,0,0,0
5,120000.0,0,0,0,1,1,0,0,0,0,1,0,1,0,0
6,135000.0,0,0,0,0,0,1,0,1,0,1,1,0,0,0
7,125000.0,0,0,0,0,1,0,0,1,0,1,1,0,0,0

In [58]:
df_final = pd.get_dummies(df_final,drop_first = True)

# Working with Time Data

## pd.to_datetime()
https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

In [59]:
df = pd.read_csv("../data&resources/time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [61]:
df["order_date"]

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

In [62]:
pd.to_datetime(df["order_date"])

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [63]:
df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])

In [64]:
df.head()

   id_product order_date  product_quantity  product_price entry_date
0         401 2021-01-23               1.0     541.487603 2018-12-04
1         416 2020-04-02               1.0     131.181818 2018-12-04
2         717 2019-03-10               1.0    2035.488500 2018-12-04
3         778 2019-12-27               1.0     335.988000 2018-12-04
4         826 2020-02-19               1.0     342.292302 2018-12-04

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

In [66]:
df.entry_date.min()

Timestamp('2018-12-04 00:00:00')

In [67]:
df.entry_date.max()

Timestamp('2020-11-26 00:00:00')

In [68]:
a = pd.Series(["15-03-2020", "18-05-2019", "24-07-2018"])
a

0    15-03-2020
1    18-05-2019
2    24-07-2018
dtype: object

In [69]:
a.max()

'24-07-2018'

In [70]:
pd.to_datetime(a, format='%d-%m-%Y')

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

In [71]:
pd.to_datetime(a, format='%d-%m-%Y').max()

Timestamp('2020-03-15 00:00:00')

## Series.dt()
Accessor object for datetimelike properties of the Series values.

https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html

In [72]:
df["entry_date"].dt.year # it can be date, year, quarter, month, week, day, weekday, dayofweek, hour, minute, second, microsecond

0      2018
1      2018
2      2018
3      2018
4      2018
       ...
906    2020
907    2020
908    2020
909    2020
910    2020
Name: entry_date, Length: 911, dtype: int64

In [73]:
df.entry_date.dt.quarter

0      4
1      4
2      4
3      4
4      4
      ..
906    4
907    4
908    4
909    4
910    4
Name: entry_date, Length: 911, dtype: int64

In [74]:
df.entry_date.dt.dayofweek

0      1
1      1
2      1
3      1
4      1
      ..
906    2
907    2
908    4
909    1
910    3
Name: entry_date, Length: 911, dtype: int64

## datetime module
The datetime module supplies classes for manipulating dates and times.

https://docs.python.org/3/library/datetime.html

### class datetime.datetime

A combination of a date and a time. Attributes: year, month, day, hour, minute, second, microsecond, and tzinfo.

In [75]:
from datetime import datetime

In [76]:
datetime.now()

datetime.datetime(2022, 1, 31, 16, 31, 33, 269405)

In [77]:
print(datetime.now())

2022-01-31 16:31:33.285361

In [78]:
print(datetime.today())

2022-01-31 16:31:33.299325

In [79]:
current_datetime = datetime.now()
print(current_datetime)

2022-01-31 16:31:33.317277

In [80]:
current_datetime.date() # it can be date, year, month, day, weekday, isoweekday, hour, minute, second, microsecond, tzinfo

datetime.date(2022, 1, 31)

In [81]:
current_datetime.year

2022

In [82]:
current_datetime.weekday() # Return the day of the week as an integer, where Monday is 0 and Sunday is 6.

0

In [83]:
current_datetime.isoweekday() # Return the day of the week as an integer, where Monday is 1 and Sunday is 7.

1

### class datetime.timedelta

A duration expressing the difference between two date, time, or datetime instances to microsecond resolution.

In [84]:
from datetime import timedelta

In [85]:
timedelta(days=2)

datetime.timedelta(days=2)

In [86]:
print(timedelta(days=2))

2 days, 0:00:00

In [87]:
current_datetime

datetime.datetime(2022, 1, 31, 16, 31, 33, 317277)

In [88]:
two_days_before = current_datetime-timedelta(days=2)
two_days_before

datetime.datetime(2022, 1, 29, 16, 31, 33, 317277)

In [89]:
current_datetime+timedelta(weeks=2, days=3, hours=4, minutes=10)

datetime.datetime(2022, 2, 17, 20, 41, 33, 317277)

In [90]:
print(f"{'current_date': <15}", current_datetime)
print(f"{'plus': <15}", timedelta(weeks=2, hours=4, minutes=10))
print(f"{'total': <15}", current_datetime+timedelta(weeks=2, days=3, hours=4, minutes=10))

current_date    2022-01-31 16:31:33.317277
plus            14 days, 4:10:00
total           2022-02-17 20:41:33.317277

### strftime()

Converting from date/datetime/timedelta object to string type

https://strftime.org/

In [91]:
current_datetime

datetime.datetime(2022, 1, 31, 16, 31, 33, 317277)

In [92]:
print(current_datetime)

2022-01-31 16:31:33.317277

In [93]:
current_datetime.strftime("%Y")

'2022'

In [94]:
year = current_datetime.strftime("%Y")
print("year:", year)

month = current_datetime.strftime("%m")
print("month:", month)

day = current_datetime.strftime("%d")
print("day:", day)

time = current_datetime.strftime("%H:%M:%S")
print("time:", time)

date_time = current_datetime.strftime("%m/%d/%Y, %H:%M:%S")
print("date and time:",date_time)

year: 2022
month: 01
day: 31
time: 16:31:33
date and time: 01/31/2022, 16:31:33

### strptime()

Converting from string type to datetime object

In [95]:
date_string = "21 June, 2018"
date_string

'21 June, 2018'

In [96]:
datetime.strptime(date_string, "%d %B, %Y")
#datetime.strptime(date_string) # gives an error

datetime.datetime(2018, 6, 21, 0, 0)

In [97]:
pd.to_datetime(date_string)

Timestamp('2018-06-21 00:00:00')

In [98]:
datetime_object = datetime.strptime(date_string, "%d %B, %Y")
datetime_object

datetime.datetime(2018, 6, 21, 0, 0)

In [99]:
datetime_object.year

2018

### Operation with datetime object

**lets detect the time between first order date and entry date for each product**

In [100]:
df

     id_product order_date  product_quantity  product_price entry_date
0           401 2021-01-23               1.0     541.487603 2018-12-04
1           416 2020-04-02               1.0     131.181818 2018-12-04
2           717 2019-03-10               1.0    2035.488500 2018-12-04
3           778 2019-12-27               1.0     335.988000 2018-12-04
4           826 2020-02-19               1.0     342.292302 2018-12-04
..          ...        ...               ...            ...        ...
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

[911 rows x 5 columns]

In [101]:
df["order_date"] - df["entry_date"]

0     781 days
1     485 days
2      96 days
3     388 days
4     442 days
        ...
906    48 days
907    48 days
908     9 days
909    63 days
910    10 days
Length: 911, dtype: timedelta64[ns]

In [102]:
df["passing_time_to_firstsale"] = df["order_date"] - df["entry_date"]

In [103]:
df["passing_time_to_firstsale"].astype("str").str.split(" ").str[0].astype(int)

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: passing_time_to_firstsale, Length: 911, dtype: int32

In [104]:
df["passing_time_to_firstsale"] = df["passing_time_to_firstsale"].astype("str").str.split(" ").str[0].astype(int)
df

,id_product,order_date,product_quantity,product_price,entry_date,passing_time_to_firstsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10

In [105]:
df.groupby("id_product")["passing_time_to_firstsale"].min()

id_product
401        781
416        485
717         96
778        388
826        442
          ...
1536841     38
1536842     48
1536887      9
1536952     63
1536974     10
Name: passing_time_to_firstsale, Length: 498, dtype: int32

In [106]:
df.groupby("id_product")["passing_time_to_firstsale"].transform(min)

0      781
1      485
2       96
3      388
4      442
      ...
906     48
907     48
908      9
909     63
910     10
Name: passing_time_to_firstsale, Length: 911, dtype: int32

In [107]:
df["passing_time_to_firstsale"]=df.groupby("id_product")["passing_time_to_firstsale"].transform(min)
df

,id_product,order_date,product_quantity,product_price,entry_date,passing_time_to_firstsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10

**lets detect the time between last order date and today for each product**

In [108]:
df.groupby("id_product").order_date.max()

id_product
401       2021-01-23
416       2020-04-02
717       2019-03-10
778       2019-12-27
826       2020-02-19
             ...
1536841   2020-11-22
1536842   2020-11-24
1536887   2020-11-22
1536952   2021-01-26
1536974   2020-12-06
Name: order_date, Length: 498, dtype: datetime64[ns]

In [109]:
df.groupby("id_product").order_date.transform(max).dt.date

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

In [110]:
last_order_date = df.groupby("id_product").order_date.transform(max).dt.date

In [111]:
today = pd.to_datetime("01-02-2021", format='%d-%m-%Y').date()
print(today)

2021-02-01

In [112]:
today - last_order_date

0       9 days
1     305 days
2     694 days
3     402 days
4     348 days
        ...
906    69 days
907    69 days
908    71 days
909     6 days
910    57 days
Name: order_date, Length: 911, dtype: timedelta64[ns]

In [113]:
df["passing_time_from_lastsale"] = today - last_order_date

In [114]:
df["passing_time_from_lastsale"] = df["passing_time_from_lastsale"].astype("str").str.split(" ").str[0].astype(int)
df

,id_product,order_date,product_quantity,product_price,entry_date,passing_time_to_firstsale,passing_time_from_lastsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781,9
1,416,2020-04-02,1.0,131.181818,2018-12-04,485,305
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96,694
3,778,2019-12-27,1.0,335.988000,2018-12-04,388,402
4,826,2020-02-19,1.0,342.292302,2018-12-04,442,348
...,...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,69
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48,69
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9,71
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63,6
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10,57

# End of The Session